const MetroList=[{
        "name": "一号线",
        "zhandian": [
            {
                "linecode": "01",
                "zdmc": "莘庄",
                "geom": "POINT(121.380674009298 31.1127323002555)",
                "zdid": "0111"
            },
            {
                "linecode": "01",
                "zdmc": "外环路",
                "geom": "POINT(121.388499103051 31.1229883370422)",
                "zdid": "0112"
            },
            {
                "linecode": "01",
                "zdmc": "莲花路",
                "geom": "POINT(121.398298233876 31.1328761410211)",
                "zdid": "0113"
            },
            {
                "linecode": "01",
                "zdmc": "锦江乐园",
                "geom": "POINT(121.409433049496 31.1440252108948)",
                "zdid": "0114"
            },
            {
                "linecode": "01",
                "zdmc": "上海南站",
                "geom": "POINT(121.42505633738 31.1568920551243)",
                "zdid": "0115"
            },
            {
                "linecode": "01",
                "zdmc": "漕宝路",
                "geom": "POINT(121.430468788404 31.1706411513681)",
                "zdid": "0116"
            },
            {
                "linecode": "01",
                "zdmc": "上海体育馆",
                "geom": "POINT(121.43163169095 31.1838651442611)",
                "zdid": "0117"
            },
            {
                "linecode": "01",
                "zdmc": "徐家汇",
                "geom": "POINT(121.433631503491 31.1938772237549)",
                "zdid": "0118"
            },
            {
                "linecode": "01",
                "zdmc": "衡山路",
                "geom": "POINT(121.44195776424 31.2066245058164)",
                "zdid": "0119"
            },
            {
                "linecode": "01",
                "zdmc": "常熟路",
                "geom": "POINT(121.44652988065 31.2153204203012)",
                "zdid": "0120"
            },
            {
                "linecode": "01",
                "zdmc": "陕西南路",
                "geom": "POINT(121.455747063776 31.2191691130641)",
                "zdid": "0121"
            },
            {
                "linecode": "01",
                "zdmc": "黄陂南路",
                "geom": "POINT(121.468735165396 31.2246756340733)",
                "zdid": "0122"
            },
            {
                "linecode": "01",
                "zdmc": "人民广场",
                "geom": "POINT(121.470419770056 31.2349944327469)",
                "zdid": "0123"
            },
            {
                "linecode": "01",
                "zdmc": "新闸路",
                "geom": "POINT(121.463511250943 31.2406904022403)",
                "zdid": "0124"
            },
            {
                "linecode": "01",
                "zdmc": "汉中路",
                "geom": "POINT(121.454106341534 31.2437598783158)",
                "zdid": "0125"
            },
            {
                "linecode": "01",
                "zdmc": "上海火车站",
                "geom": "POINT(121.451409503146 31.2494381797283)",
                "zdid": "0126"
            },
            {
                "linecode": "01",
                "zdmc": "中山北路",
                "geom": "POINT(121.454757706103 31.2605949325102)",
                "zdid": "0127"
            },
            {
                "linecode": "01",
                "zdmc": "延长路",
                "geom": "POINT(121.450734645587 31.2733093047806)",
                "zdid": "0128"
            },
            {
                "linecode": "01",
                "zdmc": "上海马戏城",
                "geom": "POINT(121.447447430155 31.281720684562)",
                "zdid": "0129"
            },
            {
                "linecode": "01",
                "zdmc": "汶水路",
                "geom": "POINT(121.445602756062 31.2944836624911)",
                "zdid": "0130"
            },
            {
                "linecode": "01",
                "zdmc": "彭浦新村",
                "geom": "POINT(121.44399468101 31.3084429401896)",
                "zdid": "0131"
            },
            {
                "linecode": "01",
                "zdmc": "共康路",
                "geom": "POINT(121.442478057117 31.320897258202)",
                "zdid": "0132"
            },
            {
                "linecode": "01",
                "zdmc": "通河新村",
                "geom": "POINT(121.436943959296 31.3329187936674)",
                "zdid": "0133"
            },
            {
                "linecode": "01",
                "zdmc": "呼兰路",
                "geom": "POINT(121.433134738677 31.3416094866885)",
                "zdid": "0134"
            },
            {
                "linecode": "01",
                "zdmc": "共富新村",
                "geom": "POINT(121.429532996151 31.3569009400264)",
                "zdid": "0135"
            },
            {
                "linecode": "01",
                "zdmc": "宝安公路",
                "geom": "POINT(121.426316569954 31.3712330020015)",
                "zdid": "0136"
            },
            {
                "linecode": "01",
                "zdmc": "友谊西路",
                "geom": "POINT(121.423332213811 31.3829597936596)",
                "zdid": "0137"
            },
            {
                "linecode": "01",
                "zdmc": "富锦路",
                "geom": "POINT(121.419850780789 31.3939918410506)",
                "zdid": "0138"
            }
        ],
        "color":"rgb(234,27,57)"
    },
    {
        "name": "二号线",
        "zhandian": [
            {
                "linecode": "02",
                "zdmc": "徐泾东",
                "geom": "POINT(121.295051475545 31.1903960758183)",
                "zdid": "0234"
            },
            {
                "linecode": "02",
                "zdmc": "虹桥火车站",
                "geom": "POINT(121.316336610846 31.1949628907249)",
                "zdid": "0235"
            },
            {
                "linecode": "02",
                "zdmc": "虹桥2号航站楼",
                "geom": "POINT(121.321390088482 31.1952411004964)",
                "zdid": "0236"
            },
            {
                "linecode": "02",
                "zdmc": "淞虹路",
                "geom": "POINT(121.355345772989 31.219998154891)",
                "zdid": "0237"
            },
            {
                "linecode": "02",
                "zdmc": "北新泾",
                "geom": "POINT(121.369642600426 31.218478895085)",
                "zdid": "0238"
            },
            {
                "linecode": "02",
                "zdmc": "威宁路",
                "geom": "POINT(121.382422586333 31.2167574335088)",
                "zdid": "0239"
            },
            {
                "linecode": "02",
                "zdmc": "娄山关路",
                "geom": "POINT(121.399662376817 31.2129393329839)",
                "zdid": "0240"
            },
            {
                "linecode": "02",
                "zdmc": "中山公园",
                "geom": "POINT(121.413121127838 31.2202620438583)",
                "zdid": "0241"
            },
            {
                "linecode": "02",
                "zdmc": "江苏路",
                "geom": "POINT(121.427980194331 31.2217724723218)",
                "zdid": "0242"
            },
            {
                "linecode": "02",
                "zdmc": "静安寺",
                "geom": "POINT(121.442222754876 31.2252891156003)",
                "zdid": "0243"
            },
            {
                "linecode": "02",
                "zdmc": "南京西路",
                "geom": "POINT(121.45563767384 31.2317119792245)",
                "zdid": "0244"
            },
            {
                "linecode": "02",
                "zdmc": "南京东路",
                "geom": "POINT(121.47908465883 31.2390290144775)",
                "zdid": "0246"
            },
            {
                "linecode": "02",
                "zdmc": "陆家嘴",
                "geom": "POINT(121.497640590941 31.2399006347066)",
                "zdid": "0247"
            },
            {
                "linecode": "02",
                "zdmc": "东昌路",
                "geom": "POINT(121.511167225487 31.2353857349638)",
                "zdid": "0248"
            },
            {
                "linecode": "02",
                "zdmc": "上海科技馆",
                "geom": "POINT(121.540111538617 31.2209800041239)",
                "zdid": "0250"
            },
            {
                "linecode": "02",
                "zdmc": "世纪公园",
                "geom": "POINT(121.546522122898 31.2118689113212)",
                "zdid": "0251"
            },
            {
                "linecode": "02",
                "zdmc": "龙阳路",
                "geom": "POINT(121.552986939895 31.2051653270183)",
                "zdid": "0252"
            },
            {
                "linecode": "02",
                "zdmc": "张江高科",
                "geom": "POINT(121.58364351004 31.2039840252426)",
                "zdid": "0253"
            },
            {
                "linecode": "02",
                "zdmc": "金科路",
                "geom": "POINT(121.597865283656 31.206343568401)",
                "zdid": "0254"
            },
            {
                "linecode": "02",
                "zdmc": "广兰路",
                "geom": "POINT(121.617793329399 31.213346226747)",
                "zdid": "0255"
            },
            {
                "linecode": "02",
                "zdmc": "唐镇",
                "geom": "POINT(121.652007350459 31.215895777768)",
                "zdid": "0256"
            },
            {
                "linecode": "02",
                "zdmc": "创新中路",
                "geom": "POINT(121.67052750574 31.2183885518902)",
                "zdid": "0257"
            },
            {
                "linecode": "02",
                "zdmc": "华夏东路",
                "geom": "POINT(121.679293332621 31.1989823206776)",
                "zdid": "0258"
            },
            {
                "linecode": "02",
                "zdmc": "川沙",
                "geom": "POINT(121.694044183692 31.1888921962179)",
                "zdid": "0259"
            },
            {
                "linecode": "02",
                "zdmc": "凌空路",
                "geom": "POINT(121.719490075607 31.1949261848956)",
                "zdid": "0260"
            },
            {
                "linecode": "02",
                "zdmc": "远东大道",
                "geom": "POINT(121.750997323468 31.2013204213005)",
                "zdid": "0261"
            },
            {
                "linecode": "02",
                "zdmc": "海天三路",
                "geom": "POINT(121.792935136847 31.1708879001565)",
                "zdid": "0262"
            },
            {
                "linecode": "02",
                "zdmc": "浦东国际机场",
                "geom": "POINT(121.801860721995 31.1521740443967)",
                "zdid": "0263"
            }
        ],
        "color":"rgb(139,196,63)",
    },
    {
        color:"rgb(251,210,8)",
        "name": "三号线",
        "zhandian": [
            {
                "linecode": "03",
                "zdmc": "上海南站",
                "geom": "POINT(121.426637837466 31.1554088113676)",
                "zdid": "0311"
            },
            {
                "linecode": "03",
                "zdmc": "石龙路",
                "geom": "POINT(121.438636495978 31.1598469269941)",
                "zdid": "0312"
            },
            {
                "linecode": "03",
                "zdmc": "龙漕路",
                "geom": "POINT(121.439814032292 31.1713960809644)",
                "zdid": "0313"
            },
            {
                "linecode": "03",
                "zdmc": "漕溪路",
                "geom": "POINT(121.433719988687 31.1786499946016)",
                "zdid": "0314"
            },
            {
                "linecode": "03",
                "zdmc": "宜山路",
                "geom": "POINT(121.422628204728 31.1884880678701)",
                "zdid": "0315"
            },
            {
                "linecode": "03",
                "zdmc": "虹桥路",
                "geom": "POINT(121.416189758551 31.199312465398)",
                "zdid": "0316"
            },
            {
                "linecode": "03",
                "zdmc": "延安西路",
                "geom": "POINT(121.412439339204 31.2114557834577)",
                "zdid": "0317"
            },
            {
                "linecode": "03",
                "zdmc": "中山公园",
                "geom": "POINT(121.411098588529 31.2198449400919)",
                "zdid": "0318"
            },
            {
                "linecode": "03",
                "zdmc": "金沙江路",
                "geom": "POINT(121.408615708748 31.2341059358403)",
                "zdid": "0319"
            },
            {
                "linecode": "03",
                "zdmc": "曹杨路",
                "geom": "POINT(121.413055255196 31.2411373212304)",
                "zdid": "0320"
            },
            {
                "linecode": "03",
                "zdmc": "镇坪路",
                "geom": "POINT(121.42516657178 31.2481837235001)",
                "zdid": "0321"
            },
            {
                "linecode": "03",
                "zdmc": "中潭路",
                "geom": "POINT(121.436364421781 31.2564523970605)",
                "zdid": "0322"
            },
            {
                "linecode": "03",
                "zdmc": "上海火车站",
                "geom": "POINT(121.453299432923 31.251658477257)",
                "zdid": "0323"
            },
            {
                "linecode": "03",
                "zdmc": "宝山路",
                "geom": "POINT(121.471835856939 31.2534650039069)",
                "zdid": "0324"
            },
            {
                "linecode": "03",
                "zdmc": "东宝兴路",
                "geom": "POINT(121.475733214716 31.2619142316565)",
                "zdid": "0325"
            },
            {
                "linecode": "03",
                "zdmc": "虹口足球场",
                "geom": "POINT(121.47471979838 31.2734134381797)",
                "zdid": "0326"
            },
            {
                "linecode": "03",
                "zdmc": "赤峰路",
                "geom": "POINT(121.477975056404 31.2832306067072)",
                "zdid": "0327"
            },
            {
                "linecode": "03",
                "zdmc": "大柏树",
                "geom": "POINT(121.478727950834 31.29142042861)",
                "zdid": "0328"
            },
            {
                "linecode": "03",
                "zdmc": "江湾镇",
                "geom": "POINT(121.48059806315 31.3074884852055)",
                "zdid": "0329"
            },
            {
                "linecode": "03",
                "zdmc": "殷高西路",
                "geom": "POINT(121.480418208634 31.3218545172722)",
                "zdid": "0330"
            },
            {
                "linecode": "03",
                "zdmc": "长江南路",
                "geom": "POINT(121.487023460165 31.3339725122217)",
                "zdid": "0331"
            },
            {
                "linecode": "03",
                "zdmc": "淞发路",
                "geom": "POINT(121.496051773071 31.3470279182039)",
                "zdid": "0332"
            },
            {
                "linecode": "03",
                "zdmc": "张华浜",
                "geom": "POINT(121.494288314954 31.3599363048166)",
                "zdid": "0333"
            },
            {
                "linecode": "03",
                "zdmc": "淞滨路",
                "geom": "POINT(121.488609802201 31.37288618435)",
                "zdid": "0334"
            },
            {
                "linecode": "03",
                "zdmc": "水产路",
                "geom": "POINT(121.483771714893 31.3832336920813)",
                "zdid": "0335"
            },
            {
                "linecode": "03",
                "zdmc": "宝杨路",
                "geom": "POINT(121.475087423246 31.3971925363065)",
                "zdid": "0336"
            },
            {
                "linecode": "03",
                "zdmc": "友谊路",
                "geom": "POINT(121.471717365864 31.405977668035)",
                "zdid": "0337"
            },
            {
                "linecode": "03",
                "zdmc": "铁力路",
                "geom": "POINT(121.456466638325 31.4099290399932)",
                "zdid": "0338"
            },
            {
                "linecode": "03",
                "zdmc": "江杨北路",
                "geom": "POINT(121.435098568444 31.4096686098185)",
                "zdid": "0339"
            }
        ]
    },
    {
        "color":"rgb(81,45,141)",
        "name": "四号线",
        "zhandian": [
            {
                "linecode": "04",
                "zdmc": "上海体育馆",
                "geom": "POINT(121.432695557454 31.1846363731701)",
                "zdid": "0401"
            },
            {
                "linecode": "04",
                "zdmc": "宜山路",
                "geom": "POINT(121.422481955178 31.1891155923108)",
                "zdid": "0402"
            },
            {
                "linecode": "04",
                "zdmc": "虹桥路",
                "geom": "POINT(121.41618775666 31.1993094652597)",
                "zdid": "0403"
            },
            {
                "linecode": "04",
                "zdmc": "延安西路",
                "geom": "POINT(121.412446346722 31.2114367969706)",
                "zdid": "0404"
            },
            {
                "linecode": "04",
                "zdmc": "中山公园",
                "geom": "POINT(121.411104593302 31.2198389470099)",
                "zdid": "0405"
            },
            {
                "linecode": "04",
                "zdmc": "金沙江路",
                "geom": "POINT(121.408617710639 31.2341039375467)",
                "zdid": "0406"
            },
            {
                "linecode": "04",
                "zdmc": "曹杨路",
                "geom": "POINT(121.413053253305 31.2411383194779)",
                "zdid": "0407"
            },
            {
                "linecode": "04",
                "zdmc": "镇坪路",
                "geom": "POINT(121.42517057826 31.2481837279967)",
                "zdid": "0408"
            },
            {
                "linecode": "04",
                "zdmc": "中潭路",
                "geom": "POINT(121.436365423625 31.2564513997124)",
                "zdid": "0409"
            },
            {
                "linecode": "04",
                "zdmc": "上海火车站",
                "geom": "POINT(121.453298431078 31.2516534770264)",
                "zdid": "0410"
            },
            {
                "linecode": "04",
                "zdmc": "宝山路",
                "geom": "POINT(121.471842880645 31.2534580260671)",
                "zdid": "0411"
            },
            {
                "linecode": "04",
                "zdmc": "海伦路",
                "geom": "POINT(121.485242392422 31.2605454212343)",
                "zdid": "0412"
            },
            {
                "linecode": "04",
                "zdmc": "临平路",
                "geom": "POINT(121.496464406307 31.2628689042766)",
                "zdid": "0413"
            },
            {
                "linecode": "04",
                "zdmc": "大连路",
                "geom": "POINT(121.508284955886 31.2605360727816)",
                "zdid": "0414"
            },
            {
                "linecode": "04",
                "zdmc": "杨树浦路",
                "geom": "POINT(121.512853526269 31.2542441045818)",
                "zdid": "0415"
            },
            {
                "linecode": "04",
                "zdmc": "浦东大道",
                "geom": "POINT(121.515041113656 31.2421727628628)",
                "zdid": "0416"
            },
            {
                "linecode": "04",
                "zdmc": "世纪大道",
                "geom": "POINT(121.522606547954 31.2309079349533)",
                "zdid": "0417"
            },
            {
                "linecode": "04",
                "zdmc": "浦电路",
                "geom": "POINT(121.527924207736 31.224453998853)",
                "zdid": "0418"
            },
            {
                "linecode": "04",
                "zdmc": "蓝村路",
                "geom": "POINT(121.523631336217 31.2137947582216)",
                "zdid": "0419"
            },
            {
                "linecode": "04",
                "zdmc": "塘桥",
                "geom": "POINT(121.51429509814 31.2117328546876)",
                "zdid": "0420"
            },
            {
                "linecode": "04",
                "zdmc": "南浦大桥",
                "geom": "POINT(121.495307673111 31.210516409205)",
                "zdid": "0421"
            },
            {
                "linecode": "04",
                "zdmc": "鲁班路",
                "geom": "POINT(121.470600259494 31.2011389992655)",
                "zdid": "0423"
            },
            {
                "linecode": "04",
                "zdmc": "大木桥路",
                "geom": "POINT(121.459148895105 31.1960765257111)",
                "zdid": "0424"
            },
            {
                "linecode": "04",
                "zdmc": "东安路",
                "geom": "POINT(121.450317499553 31.1927205166386)",
                "zdid": "0425"
            },
            {
                "linecode": "04",
                "zdmc": "上海体育场",
                "geom": "POINT(121.438964817772 31.1873574617775)",
                "zdid": "0426"
            }
        ]
    },
    {
        "color":"rgb(144,86,163)",
        "name": "五号线",
        "zhandian": [
            {
                "linecode": "05",
                "zdmc": "春申路",
                "geom": "POINT(121.381212670828 31.1000689366322)",
                "zdid": "0502"
            },
            {
                "linecode": "05",
                "zdmc": "银都路",
                "geom": "POINT(121.385728311612 31.0911182298225)",
                "zdid": "0503"
            },
            {
                "linecode": "05",
                "zdmc": "颛桥",
                "geom": "POINT(121.397241765195 31.0689277020518)",
                "zdid": "0505"
            },
            {
                "linecode": "05",
                "zdmc": "北桥",
                "geom": "POINT(121.405438352698 31.0469956268468)",
                "zdid": "0507"
            },
            {
                "linecode": "05",
                "zdmc": "剑川路",
                "geom": "POINT(121.411974858253 31.0283916520531)",
                "zdid": "0508"
            },
            {
                "linecode": "05",
                "zdmc": "东川路",
                "geom": "POINT(121.415286412938 31.0201348405505)",
                "zdid": "0509"
            },
            {
                "linecode": "05",
                "zdmc": "金平路",
                "geom": "POINT(121.405463292697 31.0131463986874)",
                "zdid": "0510"
            },
            {
                "linecode": "05",
                "zdmc": "华宁路",
                "geom": "POINT(121.39069608026 31.0093913667183)",
                "zdid": "0511"
            },
            {
                "linecode": "05",
                "zdmc": "文井路",
                "geom": "POINT(121.376227412165 31.0055412952946)",
                "zdid": "0512"
            },
            {
                "linecode": "05",
                "zdmc": "闵行开发区",
                "geom": "POINT(121.365501023653 31.0026594339857)",
                "zdid": "0513"
            }
        ]
    },
    {
        "color":"rgb(214,24,112)",
        "name": "六号线",
        "zhandian": [
            {
                "linecode": "06",
                "zdmc": "东方体育中心",
                "geom": "POINT(121.475704232265 31.1551285925106)",
                "zdid": "0621"
            },
            {
                "linecode": "06",
                "zdmc": "灵岩南路",
                "geom": "POINT(121.490345924525 31.1505038738547)",
                "zdid": "0622"
            },
            {
                "linecode": "06",
                "zdmc": "上南路",
                "geom": "POINT(121.502045935272 31.1510536087371)",
                "zdid": "0623"
            },
            {
                "linecode": "06",
                "zdmc": "华夏西路",
                "geom": "POINT(121.510012212693 31.1516248185306)",
                "zdid": "0624"
            },
            {
                "linecode": "06",
                "zdmc": "高青路",
                "geom": "POINT(121.511325995398 31.1614534920851)",
                "zdid": "0625"
            },
            {
                "linecode": "06",
                "zdmc": "东明路",
                "geom": "POINT(121.506379421973 31.17475317372)",
                "zdid": "0626"
            },
            {
                "linecode": "06",
                "zdmc": "高科西路",
                "geom": "POINT(121.505406874428 31.1876427878844)",
                "zdid": "0627"
            },
            {
                "linecode": "06",
                "zdmc": "临沂新村",
                "geom": "POINT(121.512553427898 31.1954108142577)",
                "zdid": "0628"
            },
            {
                "linecode": "06",
                "zdmc": "上海儿童医学中心",
                "geom": "POINT(121.519012697878 31.2057330402477)",
                "zdid": "0629"
            },
            {
                "linecode": "06",
                "zdmc": "蓝村路",
                "geom": "POINT(121.523317308247 31.213819903266)",
                "zdid": "0630"
            },
            {
                "linecode": "06",
                "zdmc": "浦电路",
                "geom": "POINT(121.524480367275 31.2224998916568)",
                "zdid": "0631"
            },
            {
                "linecode": "06",
                "zdmc": "源深体育中心",
                "geom": "POINT(121.530394001482 31.2351563179098)",
                "zdid": "0633"
            },
            {
                "linecode": "06",
                "zdmc": "民生路",
                "geom": "POINT(121.539233696878 31.2379741357978)",
                "zdid": "0634"
            },
            {
                "linecode": "06",
                "zdmc": "北洋泾路",
                "geom": "POINT(121.548272979714 31.2413815645077)",
                "zdid": "0635"
            },
            {
                "linecode": "06",
                "zdmc": "德平路",
                "geom": "POINT(121.559852603615 31.247497666684)",
                "zdid": "0636"
            },
            {
                "linecode": "06",
                "zdmc": "云山路",
                "geom": "POINT(121.56862703521 31.2526137578187)",
                "zdid": "0637"
            },
            {
                "linecode": "06",
                "zdmc": "金桥路",
                "geom": "POINT(121.577726818138 31.2594469856899)",
                "zdid": "0638"
            },
            {
                "linecode": "06",
                "zdmc": "博兴路",
                "geom": "POINT(121.582529580975 31.2657241132773)",
                "zdid": "0639"
            },
            {
                "linecode": "06",
                "zdmc": "五莲路",
                "geom": "POINT(121.583789810851 31.2741510935982)",
                "zdid": "0640"
            },
            {
                "linecode": "06",
                "zdmc": "巨峰路",
                "geom": "POINT(121.584267421904 31.2828386614751)",
                "zdid": "0641"
            },
            {
                "linecode": "06",
                "zdmc": "东靖路",
                "geom": "POINT(121.584674839972 31.2931536137483)",
                "zdid": "0642"
            },
            {
                "linecode": "06",
                "zdmc": "五洲大道",
                "geom": "POINT(121.585153148899 31.3052170126551)",
                "zdid": "0643"
            },
            {
                "linecode": "06",
                "zdmc": "洲海路",
                "geom": "POINT(121.585231430386 31.314482474087)",
                "zdid": "0644"
            },
            {
                "linecode": "06",
                "zdmc": "外高桥保税区南站",
                "geom": "POINT(121.597784563207 31.3237560626922)",
                "zdid": "0645"
            },
            {
                "linecode": "06",
                "zdmc": "航津路",
                "geom": "POINT(121.589819868592 31.3375382081219)",
                "zdid": "0646"
            },
            {
                "linecode": "06",
                "zdmc": "外高桥保税区北站",
                "geom": "POINT(121.582733756758 31.3499326609636)",
                "zdid": "0647"
            },
            {
                "linecode": "06",
                "zdmc": "港城路",
                "geom": "POINT(121.570714499275 31.3551949225077)",
                "zdid": "0648"
            }
        ]
    },
    {
        "color":"rgb(244,113,33)",
        "name": "七号线",
        "zhandian": [
            {
                "linecode": "07",
                "zdmc": "美兰湖",
                "geom": "POINT(121.345543678898 31.4035914356962)",
                "zdid": "0721"
            },
            {
                "linecode": "07",
                "zdmc": "罗南新村",
                "geom": "POINT(121.352950322599 31.3903039290831)",
                "zdid": "0722"
            },
            {
                "linecode": "07",
                "zdmc": "潘广路",
                "geom": "POINT(121.351747754555 31.3654764559737)",
                "zdid": "0723"
            },
            {
                "linecode": "07",
                "zdmc": "刘行",
                "geom": "POINT(121.357937088526 31.3592469807636)",
                "zdid": "0724"
            },
            {
                "linecode": "07",
                "zdmc": "顾村公园",
                "geom": "POINT(121.368153395963 31.3466477927615)",
                "zdid": "0725"
            },
            {
                "linecode": "07",
                "zdmc": "上海大学",
                "geom": "POINT(121.384261070392 31.3223833779905)",
                "zdid": "0727"
            },
            {
                "linecode": "07",
                "zdmc": "南陈路",
                "geom": "POINT(121.39376495379 31.3232095266983)",
                "zdid": "0728"
            },
            {
                "linecode": "07",
                "zdmc": "上大路",
                "geom": "POINT(121.403946304578 31.3167424551003)",
                "zdid": "0729"
            },
            {
                "linecode": "07",
                "zdmc": "场中路",
                "geom": "POINT(121.409012685687 31.3058665929689)",
                "zdid": "0730"
            },
            {
                "linecode": "07",
                "zdmc": "大场镇",
                "geom": "POINT(121.411939639003 31.2952804357436)",
                "zdid": "0731"
            },
            {
                "linecode": "07",
                "zdmc": "行知路",
                "geom": "POINT(121.416971929511 31.2868516127118)",
                "zdid": "0732"
            },
            {
                "linecode": "07",
                "zdmc": "大华三路",
                "geom": "POINT(121.418351392403 31.2756234987256)",
                "zdid": "0733"
            },
            {
                "linecode": "07",
                "zdmc": "新村路",
                "geom": "POINT(121.418065926901 31.2658753819434)",
                "zdid": "0734"
            },
            {
                "linecode": "07",
                "zdmc": "岚皋路",
                "geom": "POINT(121.417367826364 31.2583940036804)",
                "zdid": "0735"
            },
            {
                "linecode": "07",
                "zdmc": "镇坪路",
                "geom": "POINT(121.427030351969 31.2486718584196)",
                "zdid": "0736"
            },
            {
                "linecode": "07",
                "zdmc": "长寿路",
                "geom": "POINT(121.433898870137 31.2416259741594)",
                "zdid": "0737"
            },
            {
                "linecode": "07",
                "zdmc": "昌平路",
                "geom": "POINT(121.437497483023 31.236373351549)",
                "zdid": "0738"
            },
            {
                "linecode": "07",
                "zdmc": "静安寺",
                "geom": "POINT(121.444082143676 31.2246480419736)",
                "zdid": "0739"
            },
            {
                "linecode": "07",
                "zdmc": "常熟路",
                "geom": "POINT(121.444513955854 31.2155671978679)",
                "zdid": "0740"
            },
            {
                "linecode": "07",
                "zdmc": "肇嘉浜路",
                "geom": "POINT(121.445723144707 31.200882739247)",
                "zdid": "0741"
            },
            {
                "linecode": "07",
                "zdmc": "东安路",
                "geom": "POINT(121.450249309358 31.1928433055742)",
                "zdid": "0742"
            },
            {
                "linecode": "07",
                "zdmc": "龙华中路",
                "geom": "POINT(121.452444709156 31.1865763367286)",
                "zdid": "0743"
            },
            {
                "linecode": "07",
                "zdmc": "后滩",
                "geom": "POINT(121.468687375422 31.1736735223153)",
                "zdid": "0744"
            },
            {
                "linecode": "07",
                "zdmc": "长清路",
                "geom": "POINT(121.482204803609 31.1769730611579)",
                "zdid": "0745"
            },
            {
                "linecode": "07",
                "zdmc": "云台路",
                "geom": "POINT(121.49611279477 31.1842527529622)",
                "zdid": "0747"
            },
            {
                "linecode": "07",
                "zdmc": "杨高南路",
                "geom": "POINT(121.520739826982 31.1896497212577)",
                "zdid": "0749"
            },
            {
                "linecode": "07",
                "zdmc": "锦绣路",
                "geom": "POINT(121.535743793142 31.1897301656147)",
                "zdid": "0750"
            },
            {
                "linecode": "07",
                "zdmc": "芳华路",
                "geom": "POINT(121.545874873627 31.1953006841793)",
                "zdid": "0751"
            },
            {
                "linecode": "07",
                "zdmc": "龙阳路",
                "geom": "POINT(121.553362717116 31.2058126716175)",
                "zdid": "0752"
            },
            {
                "linecode": "07",
                "zdmc": "花木路",
                "geom": "POINT(121.558360515026 31.2136371205567)",
                "zdid": "0753"
            }
        ]
    },
    {
        "color":"rgb(0,158,219)",
        "name": "八号线",
        "zhandian": [
            {
                "linecode": "08",
                "zdmc": "沈杜公路",
                "geom": "POINT(121.507935261703 31.0636942889603)",
                "zdid": "0820"
            },
            {
                "linecode": "08",
                "zdmc": "联航路",
                "geom": "POINT(121.506229192024 31.0758793103819)",
                "zdid": "0821"
            },
            {
                "linecode": "08",
                "zdmc": "江月路",
                "geom": "POINT(121.504259301725 31.086294583828)",
                "zdid": "0822"
            },
            {
                "linecode": "08",
                "zdmc": "浦江镇",
                "geom": "POINT(121.501968077365 31.0985079177063)",
                "zdid": "0823"
            },
            {
                "linecode": "08",
                "zdmc": "芦恒路",
                "geom": "POINT(121.493451539857 31.1212798508844)",
                "zdid": "0824"
            },
            {
                "linecode": "08",
                "zdmc": "凌兆新村",
                "geom": "POINT(121.485513358155 31.1428085819505)",
                "zdid": "0825"
            },
            {
                "linecode": "08",
                "zdmc": "杨思",
                "geom": "POINT(121.488847497514 31.1631028145433)",
                "zdid": "0827"
            },
            {
                "linecode": "08",
                "zdmc": "成山路",
                "geom": "POINT(121.491781169665 31.1729545035475)",
                "zdid": "0828"
            },
            {
                "linecode": "08",
                "zdmc": "耀华路",
                "geom": "POINT(121.490153686344 31.1806027483182)",
                "zdid": "0829"
            },
            {
                "linecode": "08",
                "zdmc": "中华艺术宫",
                "geom": "POINT(121.489661356986 31.1872919137908)",
                "zdid": "0830"
            },
            {
                "linecode": "08",
                "zdmc": "西藏南路",
                "geom": "POINT(121.485192030388 31.2039404189152)",
                "zdid": "0831"
            },
            {
                "linecode": "08",
                "zdmc": "陆家浜路",
                "geom": "POINT(121.481643706692 31.2138012360383)",
                "zdid": "0832"
            },
            {
                "linecode": "08",
                "zdmc": "老西门",
                "geom": "POINT(121.478553370841 31.2209018980042)",
                "zdid": "0833"
            },
            {
                "linecode": "08",
                "zdmc": "大世界",
                "geom": "POINT(121.474833961918 31.2292463781179)",
                "zdid": "0834"
            },
            {
                "linecode": "08",
                "zdmc": "人民广场",
                "geom": "POINT(121.470774939312 31.2349574247454)",
                "zdid": "0835"
            },
            {
                "linecode": "08",
                "zdmc": "曲阜路",
                "geom": "POINT(121.466985864406 31.2442399283301)",
                "zdid": "0836"
            },
            {
                "linecode": "08",
                "zdmc": "中兴路",
                "geom": "POINT(121.464360646227 31.255144138891)",
                "zdid": "0837"
            },
            {
                "linecode": "08",
                "zdmc": "西藏北路",
                "geom": "POINT(121.464118006441 31.2654350235076)",
                "zdid": "0838"
            },
            {
                "linecode": "08",
                "zdmc": "虹口足球场",
                "geom": "POINT(121.475053048459 31.2719729895618)",
                "zdid": "0839"
            },
            {
                "linecode": "08",
                "zdmc": "曲阳路",
                "geom": "POINT(121.486119976955 31.2784873646003)",
                "zdid": "0840"
            },
            {
                "linecode": "08",
                "zdmc": "四平路",
                "geom": "POINT(121.496804437275 31.2769619174586)",
                "zdid": "0841"
            },
            {
                "linecode": "08",
                "zdmc": "鞍山新村",
                "geom": "POINT(121.50518368338 31.2753076100582)",
                "zdid": "0842"
            },
            {
                "linecode": "08",
                "zdmc": "江浦路",
                "geom": "POINT(121.51350588279 31.2769352075938)",
                "zdid": "0843"
            },
            {
                "linecode": "08",
                "zdmc": "黄兴路",
                "geom": "POINT(121.52399490604 31.2808067125598)",
                "zdid": "0844"
            },
            {
                "linecode": "08",
                "zdmc": "延吉中路",
                "geom": "POINT(121.530661207149 31.2903430803689)",
                "zdid": "0845"
            },
            {
                "linecode": "08",
                "zdmc": "黄兴公园",
                "geom": "POINT(121.528727567623 31.2980740789556)",
                "zdid": "0846"
            },
            {
                "linecode": "08",
                "zdmc": "翔殷路",
                "geom": "POINT(121.527649406395 31.307296687692)",
                "zdid": "0847"
            },
            {
                "linecode": "08",
                "zdmc": "嫩江路",
                "geom": "POINT(121.527685713825 31.316926102058)",
                "zdid": "0848"
            },
            {
                "linecode": "08",
                "zdmc": "市光路",
                "geom": "POINT(121.527634897633 31.3247360611203)",
                "zdid": "0849"
            }
        ]
    },
    {
        "color":"rgb(121,201,238)",
        "name": "九号线",
        "zhandian": [
            {
                "linecode": "09",
                "zdmc": "松江南站",
                "geom": "POINT(121.226313350781 30.9871891954251)",
                "zdid": "0918"
            },
            {
                "linecode": "09",
                "zdmc": "醉白池",
                "geom": "POINT(121.224465704429 31.0026656995624)",
                "zdid": "0919"
            },
            {
                "linecode": "09",
                "zdmc": "松江体育中心",
                "geom": "POINT(121.226247672392 31.0185446647046)",
                "zdid": "0920"
            },
            {
                "linecode": "09",
                "zdmc": "松江新城",
                "geom": "POINT(121.226352593597 31.0322467219087)",
                "zdid": "0921"
            },
            {
                "linecode": "09",
                "zdmc": "松江大学城",
                "geom": "POINT(121.228276834309 31.0561821224071)",
                "zdid": "0922"
            },
            {
                "linecode": "09",
                "zdmc": "洞泾",
                "geom": "POINT(121.226074838883 31.0864483975756)",
                "zdid": "0923"
            },
            {
                "linecode": "09",
                "zdmc": "佘山",
                "geom": "POINT(121.225324632526 31.1062577867675)",
                "zdid": "0924"
            },
            {
                "linecode": "09",
                "zdmc": "泗泾",
                "geom": "POINT(121.255929087857 31.1204302019923)",
                "zdid": "0925"
            },
            {
                "linecode": "09",
                "zdmc": "九亭",
                "geom": "POINT(121.315087189922 31.1395428216439)",
                "zdid": "0926"
            },
            {
                "linecode": "09",
                "zdmc": "中春路",
                "geom": "POINT(121.333350752435 31.1513956712732)",
                "zdid": "0927"
            },
            {
                "linecode": "09",
                "zdmc": "七宝",
                "geom": "POINT(121.344815568883 31.1572717210132)",
                "zdid": "0928"
            },
            {
                "linecode": "09",
                "zdmc": "星中路",
                "geom": "POINT(121.364130432573 31.1600066555827)",
                "zdid": "0929"
            },
            {
                "linecode": "09",
                "zdmc": "合川路",
                "geom": "POINT(121.38010963795 31.1684679756166)",
                "zdid": "0930"
            },
            {
                "linecode": "09",
                "zdmc": "漕河泾开发区",
                "geom": "POINT(121.392961280938 31.1724398350304)",
                "zdid": "0931"
            },
            {
                "linecode": "09",
                "zdmc": "桂林路",
                "geom": "POINT(121.41348923564 31.1766127432835)",
                "zdid": "0932"
            },
            {
                "linecode": "09",
                "zdmc": "宜山路",
                "geom": "POINT(121.422871724051 31.1862654518891)",
                "zdid": "0933"
            },
            {
                "linecode": "09",
                "zdmc": "徐家汇",
                "geom": "POINT(121.431925033613 31.1975387810899)",
                "zdid": "0934"
            },
            {
                "linecode": "09",
                "zdmc": "嘉善路",
                "geom": "POINT(121.456450303938 31.2047776976327)",
                "zdid": "0936"
            },
            {
                "linecode": "09",
                "zdmc": "打浦桥",
                "geom": "POINT(121.463948378115 31.2083786901245)",
                "zdid": "0937"
            },
            {
                "linecode": "09",
                "zdmc": "马当路",
                "geom": "POINT(121.472613041159 31.2113646065914)",
                "zdid": "0938"
            },
            {
                "linecode": "09",
                "zdmc": "小南门",
                "geom": "POINT(121.493999251265 31.2189164737163)",
                "zdid": "0940"
            },
            {
                "linecode": "09",
                "zdmc": "商城路",
                "geom": "POINT(121.512193064159 31.2323880832435)",
                "zdid": "0941"
            },
            {
                "linecode": "09",
                "zdmc": "杨高中路",
                "geom": "POINT(121.54431905548 31.2295220625932)",
                "zdid": "0943"
            }
        ]
    },
    {
        "color":"rgb(189,168,211)", 
        "name": "十号线",
        "zhandian": [
            {
                "linecode": "10",
                "zdmc": "虹桥1号航站楼",
                "geom": "POINT(121.342563119692 31.1934522455248)",
                "zdid": "1043"
            },
            {
                "linecode": "10",
                "zdmc": "上海动物园",
                "geom": "POINT(121.363352825672 31.1921283112726)",
                "zdid": "1044"
            },
            {
                "linecode": "10",
                "zdmc": "龙溪路",
                "geom": "POINT(121.37507608929 31.1960822157217)",
                "zdid": "1045"
            },
            {
                "linecode": "10",
                "zdmc": "水城路",
                "geom": "POINT(121.387763632086 31.2013350181966)",
                "zdid": "1046"
            },
            {
                "linecode": "10",
                "zdmc": "伊犁路",
                "geom": "POINT(121.399134385743 31.2007342081172)",
                "zdid": "1047"
            },
            {
                "linecode": "10",
                "zdmc": "宋园路",
                "geom": "POINT(121.40664174542 31.1984910264398)",
                "zdid": "1048"
            },
            {
                "linecode": "10",
                "zdmc": "虹桥路",
                "geom": "POINT(121.417851544713 31.1986392311157)",
                "zdid": "1049"
            },
            {
                "linecode": "10",
                "zdmc": "交通大学",
                "geom": "POINT(121.429572390054 31.2036813386229)",
                "zdid": "1050"
            },
            {
                "linecode": "10",
                "zdmc": "上海图书馆",
                "geom": "POINT(121.439571182964 31.2098045283564)",
                "zdid": "1051"
            },
            {
                "linecode": "10",
                "zdmc": "陕西南路",
                "geom": "POINT(121.45404747641 31.2170981065924)",
                "zdid": "1052"
            },
            {
                "linecode": "10",
                "zdmc": "新天地",
                "geom": "POINT(121.470553645834 31.2182136409468)",
                "zdid": "1053"
            },
            {
                "linecode": "10",
                "zdmc": "豫园",
                "geom": "POINT(121.482800349956 31.2303498192888)",
                "zdid": "1055"
            },
            {
                "linecode": "10",
                "zdmc": "南京东路",
                "geom": "POINT(121.479874239305 31.240836475523)",
                "zdid": "1056"
            },
            {
                "linecode": "10",
                "zdmc": "天潼路",
                "geom": "POINT(121.477742403589 31.2464148091962)",
                "zdid": "1057"
            },
            {
                "linecode": "10",
                "zdmc": "四川北路",
                "geom": "POINT(121.47970252725 31.2539151172889)",
                "zdid": "1058"
            },
            {
                "linecode": "10",
                "zdmc": "海伦路",
                "geom": "POINT(121.484146453396 31.2612878664419)",
                "zdid": "1059"
            },
            {
                "linecode": "10",
                "zdmc": "邮电新村",
                "geom": "POINT(121.489639232764 31.2702572980359)",
                "zdid": "1060"
            },
            {
                "linecode": "10",
                "zdmc": "同济大学",
                "geom": "POINT(121.502038646267 31.2844554599516)",
                "zdid": "1062"
            },
            {
                "linecode": "10",
                "zdmc": "国权路",
                "geom": "POINT(121.505754345487 31.2915615933929)",
                "zdid": "1063"
            },
            {
                "linecode": "10",
                "zdmc": "五角场",
                "geom": "POINT(121.509805056558 31.2992744013926)",
                "zdid": "1064"
            },
            {
                "linecode": "10",
                "zdmc": "江湾体育场",
                "geom": "POINT(121.509787514382 31.304957117577)",
                "zdid": "1065"
            },
            {
                "linecode": "10",
                "zdmc": "三门路",
                "geom": "POINT(121.504102471652 31.3148795706358)",
                "zdid": "1066"
            },
            {
                "linecode": "10",
                "zdmc": "殷高东路",
                "geom": "POINT(121.502253076119 31.3239026962525)",
                "zdid": "1067"
            },
            {
                "linecode": "10",
                "zdmc": "新江湾城",
                "geom": "POINT(121.502324770072 31.3305474828801)",
                "zdid": "1068"
            }
        ]
    },
    {
        "color":"rgb(127,33,49)",
        "name": "十一号线",
        "zhandian": [
            {
                "linecode": "11",
                "zdmc": "花桥",
                "geom": "POINT(121.096991033909 31.3007395471924)",
                "zdid": "1114"
            },
            {
                "linecode": "11",
                "zdmc": "光明路",
                "geom": "POINT(121.113291737024 31.2978295424994)",
                "zdid": "1115"
            },
            {
                "linecode": "11",
                "zdmc": "兆丰路",
                "geom": "POINT(121.145547144385 31.2909743486873)",
                "zdid": "1116"
            },
            {
                "linecode": "11",
                "zdmc": "安亭",
                "geom": "POINT(121.157098316434 31.2903681201926)",
                "zdid": "1117"
            },
            {
                "linecode": "11",
                "zdmc": "上海汽车城",
                "geom": "POINT(121.176158238512 31.2872560198495)",
                "zdid": "1118"
            },
            {
                "linecode": "11",
                "zdmc": "昌吉东路",
                "geom": "POINT(121.195972788014 31.2955960492184)",
                "zdid": "1119"
            },
            {
                "linecode": "11",
                "zdmc": "上海赛车场",
                "geom": "POINT(121.221695453482 31.3337975608088)",
                "zdid": "1120"
            },
            {
                "linecode": "11",
                "zdmc": "嘉定北",
                "geom": "POINT(121.232544543696 31.3932405923795)",
                "zdid": "1131"
            },
            {
                "linecode": "11",
                "zdmc": "嘉定西",
                "geom": "POINT(121.223466090887 31.3790800086355)",
                "zdid": "1132"
            },
            {
                "linecode": "11",
                "zdmc": "白银路",
                "geom": "POINT(121.240937607884 31.3472827590921)",
                "zdid": "1133"
            },
            {
                "linecode": "11",
                "zdmc": "嘉定新城",
                "geom": "POINT(121.249915826754 31.3320620167488)",
                "zdid": "1134"
            },
            {
                "linecode": "11",
                "zdmc": "马陆",
                "geom": "POINT(121.272454894878 31.3215864410615)",
                "zdid": "1135"
            },
            {
                "linecode": "11",
                "zdmc": "南翔",
                "geom": "POINT(121.318638437314 31.2988419983596)",
                "zdid": "1137"
            },
            {
                "linecode": "11",
                "zdmc": "桃浦新村",
                "geom": "POINT(121.345072103195 31.28347780066)",
                "zdid": "1138"
            },
            {
                "linecode": "11",
                "zdmc": "武威路",
                "geom": "POINT(121.36022528397 31.2785069167609)",
                "zdid": "1139"
            },
            {
                "linecode": "11",
                "zdmc": "李子园",
                "geom": "POINT(121.385406857041 31.270808300063)",
                "zdid": "1141"
            },
            {
                "linecode": "11",
                "zdmc": "上海西站",
                "geom": "POINT(121.398294766091 31.2645007457129)",
                "zdid": "1142"
            },
            {
                "linecode": "11",
                "zdmc": "真如",
                "geom": "POINT(121.402579462772 31.2528693442449)",
                "zdid": "1143"
            },
            {
                "linecode": "11",
                "zdmc": "枫桥路",
                "geom": "POINT(121.406669816859 31.2437336846619)",
                "zdid": "1144"
            },
            {
                "linecode": "11",
                "zdmc": "曹杨路",
                "geom": "POINT(121.412456866991 31.2400014352181)",
                "zdid": "1145"
            },
            {
                "linecode": "11",
                "zdmc": "隆德路",
                "geom": "POINT(121.41882972741 31.2320222066596)",
                "zdid": "1146"
            },
            {
                "linecode": "11",
                "zdmc": "江苏路",
                "geom": "POINT(121.426180365831 31.2219440431831)",
                "zdid": "1147"
            },
            {
                "linecode": "11",
                "zdmc": "上海游泳馆",
                "geom": "POINT(121.437389049065 31.1810398637987)",
                "zdid": "1150"
            },
            {
                "linecode": "11",
                "zdmc": "龙华",
                "geom": "POINT(121.448575543327 31.1745848575052)",
                "zdid": "1151"
            },
            {
                "linecode": "11",
                "zdmc": "云锦路",
                "geom": "POINT(121.454279409767 31.167251379048)",
                "zdid": "1152"
            },
            {
                "linecode": "11",
                "zdmc": "龙耀路",
                "geom": "POINT(121.455157332445 31.1618012554237)",
                "zdid": "1153"
            },
            {
                "linecode": "11",
                "zdmc": "三林",
                "geom": "POINT(121.506550524287 31.1450861267234)",
                "zdid": "1155"
            },
            {
                "linecode": "11",
                "zdmc": "三林东",
                "geom": "POINT(121.51869942354 31.1486261766568)",
                "zdid": "1156"
            },
            {
                "linecode": "11",
                "zdmc": "浦三路",
                "geom": "POINT(121.534757969805 31.1530286350635)",
                "zdid": "1157"
            },
            {
                "linecode": "11",
                "zdmc": "御桥",
                "geom": "POINT(121.566932074855 31.1605403978211)",
                "zdid": "1159"
            },
            {
                "linecode": "11",
                "zdmc": "罗山路",
                "geom": "POINT(121.588906527015 31.1556891552304)",
                "zdid": "1160"
            }
        ]
    },
    {
        "color":"rgb(1,124,103)", 
        "name": "十二号线",
        "zhandian": [
            {
                "linecode": "12",
                "zdmc": "七莘路",
                "geom": "POINT(121.357735090003 31.1333215995123)",
                "zdid": "1220"
            },
            {
                "linecode": "12",
                "zdmc": "虹莘路",
                "geom": "POINT(121.375277822514 31.1391733378793)",
                "zdid": "1221"
            },
            {
                "linecode": "12",
                "zdmc": "顾戴路",
                "geom": "POINT(121.388138527071 31.1430306884156)",
                "zdid": "1222"
            },
            {
                "linecode": "12",
                "zdmc": "东兰路",
                "geom": "POINT(121.38762455373 31.1570804918712)",
                "zdid": "1223"
            },
            {
                "linecode": "12",
                "zdmc": "虹梅路",
                "geom": "POINT(121.39794451163 31.1640206734154)",
                "zdid": "1224"
            },
            {
                "linecode": "12",
                "zdmc": "桂林公园",
                "geom": "POINT(121.414067420575 31.1687541785626)",
                "zdid": "1226"
            },
            {
                "linecode": "12",
                "zdmc": "漕宝路",
                "geom": "POINT(121.430033072269 31.1702417291725)",
                "zdid": "1227"
            },
            {
                "linecode": "12",
                "zdmc": "龙漕路",
                "geom": "POINT(121.439507281636 31.1723710243034)",
                "zdid": "1228"
            },
            {
                "linecode": "12",
                "zdmc": "龙华",
                "geom": "POINT(121.447757370706 31.1756665647602)",
                "zdid": "1229"
            },
            {
                "linecode": "12",
                "zdmc": "南京西路",
                "geom": "POINT(121.455871386056 31.2311308031441)",
                "zdid": "1234"
            },
            {
                "linecode": "12",
                "zdmc": "汉中路",
                "geom": "POINT(121.453235998343 31.2430841735958)",
                "zdid": "1235"
            },
            {
                "linecode": "12",
                "zdmc": "国际客运中心",
                "geom": "POINT(121.493494616483 31.2521576990187)",
                "zdid": "1238"
            },
            {
                "linecode": "12",
                "zdmc": "提篮桥",
                "geom": "POINT(121.502406409628 31.2555698626591)",
                "zdid": "1239"
            },
            {
                "linecode": "12",
                "zdmc": "江浦公园",
                "geom": "POINT(121.519415941293 31.2666802203159)",
                "zdid": "1241"
            },
            {
                "linecode": "12",
                "zdmc": "宁国路",
                "geom": "POINT(121.528377755629 31.2708124009716)",
                "zdid": "1242"
            },
            {
                "linecode": "12",
                "zdmc": "隆昌路",
                "geom": "POINT(121.539915336224 31.276928578691)",
                "zdid": "1243"
            },
            {
                "linecode": "12",
                "zdmc": "爱国路",
                "geom": "POINT(121.548707642744 31.2821137080812)",
                "zdid": "1244"
            },
            {
                "linecode": "12",
                "zdmc": "复兴岛",
                "geom": "POINT(121.556805539544 31.2841121941225)",
                "zdid": "1245"
            },
            {
                "linecode": "12",
                "zdmc": "东陆路",
                "geom": "POINT(121.57461131476 31.284695864023)",
                "zdid": "1246"
            },
            {
                "linecode": "12",
                "zdmc": "巨峰路",
                "geom": "POINT(121.585140034985 31.2823522010933)",
                "zdid": "1247"
            },
            {
                "linecode": "12",
                "zdmc": "杨高北路",
                "geom": "POINT(121.59881297394 31.2822651188402)",
                "zdid": "1248"
            },
            {
                "linecode": "12",
                "zdmc": "金京路",
                "geom": "POINT(121.611680400031 31.2819947907271)",
                "zdid": "1249"
            },
            {
                "linecode": "12",
                "zdmc": "申江路",
                "geom": "POINT(121.621836650741 31.2820252013021)",
                "zdid": "1250"
            },
            {
                "linecode": "12",
                "zdmc": "金海路",
                "geom": "POINT(121.634962100421 31.2654698722368)",
                "zdid": "1251"
            }
        ]
    },
    {
        "color":"rgb(232,149,193)",
        "name": "十三号线",
        "zhandian": [
            {
                "linecode": "13",
                "zdmc": "金运路",
                "geom": "POINT(121.313310317517 31.2428738932156)",
                "zdid": "1321"
            },
            {
                "linecode": "13",
                "zdmc": "金沙江西路",
                "geom": "POINT(121.33089833539 31.2430852276012)",
                "zdid": "1322"
            },
            {
                "linecode": "13",
                "zdmc": "丰庄",
                "geom": "POINT(121.350940838749 31.2443568312028)",
                "zdid": "1323"
            },
            {
                "linecode": "13",
                "zdmc": "祁连山南路",
                "geom": "POINT(121.362650795098 31.2394696678909)",
                "zdid": "1324"
            },
            {
                "linecode": "13",
                "zdmc": "真北路",
                "geom": "POINT(121.377435367149 31.2340340260495)",
                "zdid": "1325"
            },
            {
                "linecode": "13",
                "zdmc": "金沙江路",
                "geom": "POINT(121.407463153802 31.2330408966201)",
                "zdid": "1327"
            },
            {
                "linecode": "13",
                "zdmc": "武宁路",
                "geom": "POINT(121.425191724019 31.2353635666753)",
                "zdid": "1329"
            },
            {
                "linecode": "13",
                "zdmc": "江宁路",
                "geom": "POINT(121.439579062824 31.246045656382)",
                "zdid": "1331"
            },
            {
                "linecode": "13",
                "zdmc": "自然博物馆",
                "geom": "POINT(121.458362995556 31.2378177400967)",
                "zdid": "1333"
            },
            {
                "linecode": "13",
                "zdmc": "南京西路",
                "geom": "POINT(121.455871386056 31.231132802337)",
                "zdid": "1334"
            },
            {
                "linecode": "13",
                "zdmc": "淮海中路",
                "geom": "POINT(121.459826594522 31.2229422546814)",
                "zdid": "1335"
            },
            {
                "linecode": "13",
                "zdmc": "世博大道",
                "geom": "POINT(121.479980424957 31.1843068750623)",
                "zdid": "1339"
            }
        ]
    },
    {
        "color":"rgb(142,209,192)",
        "name": "十六号线",
        "zhandian": [
            {
                "linecode": "16",
                "zdmc": "龙阳路",
                "geom": "POINT(121.552986939895 31.2051613295318)",
                "zdid": "1621"
            },
            {
                "linecode": "16",
                "zdmc": "华夏中路",
                "geom": "POINT(121.579756826316 31.1740929193528)",
                "zdid": "1622"
            },
            {
                "linecode": "16",
                "zdmc": "周浦东",
                "geom": "POINT(121.603116439472 31.1110925951472)",
                "zdid": "1624"
            },
            {
                "linecode": "16",
                "zdmc": "鹤沙航城",
                "geom": "POINT(121.610981477513 31.0807390632572)",
                "zdid": "1625"
            },
            {
                "linecode": "16",
                "zdmc": "航头东",
                "geom": "POINT(121.61735065341 31.056828323968)",
                "zdid": "1626"
            },
            {
                "linecode": "16",
                "zdmc": "新场",
                "geom": "POINT(121.645297400755 31.0477058583388)",
                "zdid": "1627"
            },
            {
                "linecode": "16",
                "zdmc": "野生动物园",
                "geom": "POINT(121.695198768409 31.0528552864424)",
                "zdid": "1628"
            },
            {
                "linecode": "16",
                "zdmc": "惠南",
                "geom": "POINT(121.758443969913 31.0559951632462)",
                "zdid": "1629"
            },
            {
                "linecode": "16",
                "zdmc": "惠南东",
                "geom": "POINT(121.789451844927 31.0275522824119)",
                "zdid": "1630"
            },
            {
                "linecode": "16",
                "zdmc": "书院",
                "geom": "POINT(121.854603892456 30.9585497470732)",
                "zdid": "1631"
            },
            {
                "linecode": "16",
                "zdmc": "临港大道",
                "geom": "POINT(121.907108392738 30.9256161474673)",
                "zdid": "1632"
            },
            {
                "linecode": "16",
                "zdmc": "滴水湖",
                "geom": "POINT(121.925903742364 30.9091949648758)",
                "zdid": "1633"
            }
        ]
    }
]
export default MetroList;